xfire-sandbox/xfire-ws-security/src/test/org/codehaus/xfire/security/wssecurity/wss4j-pass-ttl-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
<wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2006-01-10T19:16:26.953Z</wsu:Created>
<wsu:Expires xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2006-01-12T19:16:29.953Z</wsu:Expires>
</wsu:Timestamp>
<wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:Username xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">userName</wsse:Username>
<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">YmaHxYKahjd2wn62vKEphwfqTb4=</wsse:Password>
<wsse:Nonce xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">r+/Au6p8ivtAZPUiU/msLQ==</wsse:Nonce>
<wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2006-01-10T19:16:26.953Z</wsu:Created>
</wsse:UsernameToken>
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference>
<ds:X509IssuerSerial xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:X509IssuerName xmlns:ds="http://www.w3.org/2000/09/xmldsig#">CN=alias</ds:X509IssuerName>

<ds:X509SerialNumber xmlns:ds="http://www.w3.org/2000/09/xmldsig#">1131487533</ds:X509SerialNumber>
</ds:X509IssuerSerial>
</wsse:SecurityTokenReference>
</ds:KeyInfo>
<xenc:CipherData>
<xenc:CipherValue>ubruu7o4hCpWoa+9A//Xp5a0KNLn00JJrEzJVOc7SVKTkriF6pQX5y++UWlSymJsAIfyy9wGy0j+
xHPmZlnacJf04JKnogXAVZjfCo5PDx3I9KV5qDVQftSD1cYwVHQeQr/ssxNBZ0HmsXbiNexo0/BD
Zv3bbGEPlHBW3rtHRDs=</xenc:CipherValue>
</xenc:CipherData>
<xenc:ReferenceList>
<xenc:DataReference URI="#EncDataId-20056641"/>
</xenc:ReferenceList>
</xenc:EncryptedKey>
</wsse:Security>
</soapenv:Header>
	<soapenv:Body>
<xenc:EncryptedData Id="EncDataId-20056641" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"/>
<xenc:CipherData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
<xenc:CipherValue xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">MCoUhaDqG6i1K/mBV0b5U/XMCktZC89Ovezc8a1zF4wuZML3Edv1Wa3dvCy3l/nNNEhsRVekPQvN
M917Qi2SV2phD8SL4OKRJVZLzciG0404t4+Cubtj42HrpGDoefrL5lWAng9oanNg1fcv8yqh3Tj9
Di7zIltJb1FppFp4NMFVQPjfh4hnDyLLiBUHnjc1IQcPwmrLdm6Txr2AUPevesu5H0cItu5rO7Wa
voDfnw5t1z6JXpnQvQxyUnpjoCCSwxmwQzdmR6oS2SXL2XCLucQefRtPwhBsCLn0NdxLLEPlBWhp
1RvsAYnl0Alo/ZKX9aWaITRAJH1debaeQWiNifLoWM19U0Nt6wYie2ZD72bDMdcOPdazMRQsa7YJ
0o1/</xenc:CipherValue>
</xenc:CipherData>
</xenc:EncryptedData>
</soapenv:Body>
</soapenv:Envelope>
